zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0.h
/* TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0 - Peripheral instance base addresses */
/** Peripheral NETC__TMR_MEDIA_CHANNEL0_PCI_HDR_TYPE0 base address */
#define IP_NETC__TMR_MEDIA_CHANNEL0_PCI_HDR_TYPE0_BASE (0x6D403000u)
/** Peripheral NETC__TMR_MEDIA_CHANNEL0_PCI_HDR_TYPE0 base pointer */
#define IP_NETC__TMR_MEDIA_CHANNEL0_PCI_HDR_TYPE0 ((TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_Type *)IP_NETC__TMR_MEDIA_CHANNEL0_PCI_HDR_TYPE0_BASE)
/** Array initializer of TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0 peripheral base
 * addresses */
#define IP_TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_BASE_ADDRS { IP_NETC__TMR_MEDIA_CHANNEL0_PCI_HDR_TYPE0_BASE }
/** Array initializer of TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0 peripheral base
 * pointers */
#define IP_TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_BASE_PTRS { IP_NETC__TMR_MEDIA_CHANNEL0_PCI_HDR_TYPE0 }

/* ----------------------------------------------------------------------------
   -- TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_Register_Masks TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0 Register Masks
 * @{
 */

/*! @name PCI_CFH_DID_VID - PCI device ID and vendor ID register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID_MASK (0xFFFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID_WIDTH (16U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_VENDOR_ID_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID_MASK (0xFFFF0000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID_SHIFT (16U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID_WIDTH (16U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_DID_VID_DEVICE_ID_MASK)
/*! @} */

/*! @name PCI_CFH_CMD - PCI command register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK (0x2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_MEM_ACCESS_SHIFT (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_MEM_ACCESS_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_MEM_ACCESS(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_MEM_ACCESS_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_MEM_ACCESS_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK (0x4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_SHIFT (2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CMD_BUS_MASTER_EN_MASK)
/*! @} */

/*! @name PCI_CFH_STAT - PCI status register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST_MASK (0x10U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST_SHIFT (4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_STAT_CAP_LIST_MASK)
/*! @} */

/*! @name PCI_CFH_REVID_CLASSCODE - PCI revision ID and classcode register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID_MASK (0xFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_REV_ID_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_MASK (0xFFFFFF00U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_SHIFT (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_WIDTH (24U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_REVID_CLASSCODE_CLASS_CODE_MASK)
/*! @} */

/*! @name PCI_CFH_CL_SIZE - PCI cache line size register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_MASK (0xFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE(x) (((uint8_t)(((uint8_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CL_SIZE_CACHE_LINE_SIZE_MASK)
/*! @} */

/*! @name PCI_CFH_HDR_TYPE - PCI header type register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_MASK (0x7FU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_WIDTH (7U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE(x) (((uint8_t)(((uint8_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_HDR_TYPE_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_MASK (0x80U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_SHIFT (7U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV(x) (((uint8_t)(((uint8_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_HDR_TYPE_MULT_FUNC_DEV_MASK)
/*! @} */

/*! @name PCI_CFH_BAR0 - PCI base address register 0 */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_MASK (0x1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_IO_IND_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE_MASK (0x6U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE_SHIFT (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE_WIDTH (2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_MEM_TYPE_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM_MASK (0x8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM_SHIFT (3U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_PF_MEM_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR_MASK (0xFFFFFFF0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR_SHIFT (4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR_WIDTH (28U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR0_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_BAR1 - PCI base address register 1 */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_MASK (0x1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_IO_IND_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE_MASK (0x6U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE_SHIFT (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE_WIDTH (2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR1_MEM_TYPE_MASK)

