zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0.h
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR_MASK (0xFFFFFFF0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR_SHIFT (4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR_WIDTH (28U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_BAR5_ADDR_MASK)
/*! @} */

/*! @name PCI_CFH_SUBSYS_VID - PCI subsystem vendor ID register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_MASK (0xFFFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_WIDTH (16U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_VID_SUBSYSTEM_VENDOR_ID_MASK)
/*! @} */

/*! @name PCI_CFH_SUBSYS_ID - PCI subsystem ID register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_MASK (0xFFFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_WIDTH (16U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_SUBSYS_ID_SUBSYSTEM_ID_MASK)
/*! @} */

/*! @name PCI_CFH_CAP_PTR - PCI capabilities pointer register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CAP_PTR_CAP_PTR_MASK (0xFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CAP_PTR_CAP_PTR_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CAP_PTR_CAP_PTR_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CAP_PTR_CAP_PTR(x) (((uint8_t)(((uint8_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CAP_PTR_CAP_PTR_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFH_CAP_PTR_CAP_PTR_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_CAP_LIST - PCI PCIe capabilities list register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_CAP_ID_MASK (0xFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_CAP_ID_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_CAP_ID_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_CAP_ID(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_CAP_ID_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_CAP_ID_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR_MASK (0xFF00U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR_SHIFT (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_LIST_NEXT_CAP_PTR_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_CAP - PCI PCIe capabilities register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_CAP_VER_MASK (0xFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_CAP_VER_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_CAP_VER_WIDTH (4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_CAP_VER(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_CAP_VER_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_CAP_VER_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_MASK (0xF0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_SHIFT (4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_WIDTH (4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_DEV_PORT_TYPE_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_INT_MSG_NUM_MASK (0x3E00U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_INT_MSG_NUM_SHIFT (9U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_INT_MSG_NUM_WIDTH (5U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_INT_MSG_NUM(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_INT_MSG_NUM_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_CAP_INT_MSG_NUM_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_DEV_CAP - PCI PCIe device capabilities register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_MASK (0x10000000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_SHIFT (28U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP_FLR_CAP(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CAP_FLR_CAP_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_DEV_CTL - PCI PCIe device control register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_MASK (0x8000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_SHIFT (15U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_CTL_INIT_FLR_MASK)
/*! @} */

/*! @name PCI_CFC_PCIE_DEV_STAT - PCI PCIe device status register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_MASK (0x20U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_SHIFT (5U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIE_DEV_STAT_TRANS_PEND_MASK)
/*! @} */

