zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0.h
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR_MASK (0x7U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR_WIDTH (3U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_BIR_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET_MASK (0xFFFFFFF8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET_SHIFT (3U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET_WIDTH (29U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_MSIX_PBA_OFF_BIR_PBA_OFFSET_MASK)
/*! @} */

/*! @name PCI_CFC_PCIPM_CAP_LIST - PCI PCI-PM capabilities list register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_CAP_ID_MASK (0xFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_CAP_ID_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_CAP_ID_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_CAP_ID(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_CAP_ID_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_CAP_ID_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_NEXT_CAP_PTR_MASK (0xFF00U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_NEXT_CAP_PTR_SHIFT (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_NEXT_CAP_PTR_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_NEXT_CAP_PTR(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_NEXT_CAP_PTR_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_LIST_NEXT_CAP_PTR_MASK)
/*! @} */

/*! @name PCI_CFC_PCIPM_CAP - PCI PCI-PM capabilities register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_VERSION_MASK (0x7U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_VERSION_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_VERSION_WIDTH (3U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_VERSION(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_VERSION_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_VERSION_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_MASK (0xF800U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_SHIFT (11U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_WIDTH (5U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CAP_PME_SUPPORT_MASK)
/*! @} */

/*! @name PCI_CFC_PCIPM_CTL_STAT - PCI PCI-PM control and status register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_MASK (0x3U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_WIDTH (2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_PWR_STATE_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_MASK (0x8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_SHIFT (3U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_PCIPM_CTL_STAT_NO_SOFT_RST_MASK)
/*! @} */

/*! @name PCI_CFC_EA_CAP_LIST - PCI EA capabilities list register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_MASK (0xFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_CAP_ID_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_MASK (0xFF00U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_SHIFT (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_LIST_NEXT_CAP_PTR_MASK)
/*! @} */

/*! @name PCI_CFC_EA_CAP - PCI EA capabilities register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_MASK (0x3FU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_WIDTH (6U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_CAP_NUM_ENTRIES_MASK)
/*! @} */

/*! @name PCI_CFC_EA_PE_FMT - PCI EA per-entry 0 format register..PCI EA per-entry 1 format register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_MASK (0x7U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_WIDTH (3U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENTRY_SIZE_MASK)

