zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0.h
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI_MASK (0xF0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI_SHIFT (4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI_WIDTH (4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_BEI_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_MASK (0xFF00U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_SHIFT (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_PRIM_PROP_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_MASK (0xFF0000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_SHIFT (16U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_WIDTH (8U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_SEC_PROP_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_MASK (0x40000000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_SHIFT (30U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_WRITABLE_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_MASK (0x80000000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_SHIFT (31U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_FMT_ENABLE_MASK)
/*! @} */

/*! @name PCI_CFC_EA_PE_BASE - PCI EA per-entry 0 base register..PCI EA per-entry 1 base register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S_MASK (0x2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S_SHIFT (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_S_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE_MASK (0xFFFFFFFCU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE_SHIFT (2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE_WIDTH (30U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_BASE_BASE_MASK)
/*! @} */

/*! @name PCI_CFC_EA_PE_MAXOFF - PCI EA per-entry 0 max offset register..PCI EA per-entry 1 max offset register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_MASK (0x2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_SHIFT (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_S_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET_MASK (0xFFFFFFFCU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET_SHIFT (2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET_WIDTH (30U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_MAXOFF_MAX_OFFSET_MASK)
/*! @} */

/*! @name PCI_CFC_EA_PE_EXT_BASE - PCI EA per-entry 0 extended base register..PCI EA per-entry 1 extended base register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_EXT_BASE_BASE_MASK (0xFFFFFFFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_EXT_BASE_BASE_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_EXT_BASE_BASE_WIDTH (32U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_EXT_BASE_BASE(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_EXT_BASE_BASE_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCI_CFC_EA_PE_EXT_BASE_BASE_MASK)
/*! @} */

/*! @name PCIE_CFC_AER_EXT_CAP_HDR - PCIe AER extended capability header */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_PCIE_EXT_CAP_ID_MASK (0xFFFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_PCIE_EXT_CAP_ID_WIDTH (16U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_PCIE_EXT_CAP_ID(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_PCIE_EXT_CAP_ID_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_CAP_VER_MASK (0xF0000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_CAP_VER_SHIFT (16U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_CAP_VER_WIDTH (4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_CAP_VER(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_CAP_VER_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_AER_EXT_CAP_HDR_CAP_VER_MASK)

