zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0.h
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_HDR_NEXT_CAP_OFF_MASK (0xFFF00000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_HDR_NEXT_CAP_OFF_SHIFT (20U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_HDR_NEXT_CAP_OFF_WIDTH (12U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_HDR_NEXT_CAP_OFF(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_HDR_NEXT_CAP_OFF_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_HDR_NEXT_CAP_OFF_MASK)
/*! @} */

/*! @name PCIE_CFC_ACS_CAP - PCIe ACS capability register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_TRANS_BLOCK_MASK (0x2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_TRANS_BLOCK_SHIFT (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_TRANS_BLOCK_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_TRANS_BLOCK(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_TRANS_BLOCK_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_TRANS_BLOCK_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_P2P_REQ_REDIR_MASK (0x4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_P2P_REQ_REDIR_SHIFT (2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_P2P_REQ_REDIR_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_P2P_REQ_REDIR(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_P2P_REQ_REDIR_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_P2P_REQ_REDIR_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_DIR_TRANS_P2P_MASK (0x40U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_DIR_TRANS_P2P_SHIFT (6U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_DIR_TRANS_P2P_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_DIR_TRANS_P2P(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_DIR_TRANS_P2P_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CAP_ACS_DIR_TRANS_P2P_MASK)
/*! @} */

/*! @name PCIE_CFC_ACS_CTL - PCIe ACS control register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_TRANS_BLOCK_EN_MASK (0x2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_TRANS_BLOCK_EN_SHIFT (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_TRANS_BLOCK_EN_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_TRANS_BLOCK_EN(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_TRANS_BLOCK_EN_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_TRANS_BLOCK_EN_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN_MASK (0x4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN_SHIFT (2U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_P2P_REQ_REDIR_EN_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN_MASK (0x40U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN_SHIFT (6U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN(x) (((uint16_t)(((uint16_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_ACS_CTL_ACS_DIR_TRANS_P2P_EN_MASK)
/*! @} */

/*! @name PCIE_CFC_RTR_CAP_HDR - PCIe readiness time reporting capability header */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID_MASK (0xFFFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID_WIDTH (16U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_PCIE_EXT_CAP_ID_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER_MASK (0xF0000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER_SHIFT (16U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER_WIDTH (4U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_CAP_VER_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF_MASK (0xFFF00000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF_SHIFT (20U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF_WIDTH (12U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_CAP_HDR_NEXT_CAP_OFF_MASK)
/*! @} */

/*! @name PCIE_CFC_RTR_RTR1 - PCIe RTR readiness time reporting 1 register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME_MASK (0xFFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME_WIDTH (12U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_RESET_TIME_MASK)

