zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0.h
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID_MASK (0x80000000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID_SHIFT (31U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID_WIDTH (1U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR1_VALID_MASK)
/*! @} */

/*! @name PCIE_CFC_RTR_RTR2 - PCIe RTR readiness time reporting 2 register */
/*! @{ */

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME_MASK (0xFFFU)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME_SHIFT (0U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME_WIDTH (12U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_FLR_TIME_MASK)

#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME_MASK (0xFFF000U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME_SHIFT (12U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME_WIDTH (12U)
#define TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME(x) (((uint32_t)(((uint32_t)(x)) << TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME_SHIFT)) & TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_PCIE_CFC_RTR_RTR2_D3HOT_D0_TIME_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_Register_Masks */

/*!
 * @}
 */ /* end of group TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_TMR_MEDIA_CHANNEL_PCI_HDR_TYPE0_H_) */
